src/cf/DataProcessors/ор_РасчетСписанияПоНормамЕстественнойУбыли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_РасчетСписанияПоНормамЕстественнойУбыли</Name>
			<Comment>Расчет списания по нормам естественной убыли </Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерииНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ор_НормыЕстественнойУбыли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_НормыЕстественнойУбыли</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНормы</Name>
					<Comment>Значение нормы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНормыЕУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ВидыНормЕстественнойУбыли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ор_РасчетСписанияПоНормамЕстественнойУбыли/Forms/Форма/Ext/Form/Module.bsl
#Область Переменные

&НаКлиенте
Перем СкладБыл;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТабличнойЧасти = "Запасы";
	Объект.Дата = ТекущаяДатаСеанса();
	СтруктураВыбораНоменклатуры = Новый Структура("Характеристика");
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Объект.Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
	Объект.СтруктурнаяЕдиница = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад");
	Объект.Корреспонденция = ПланыСчетов.Управленческий.НедостачиИПотериОтПорчиЦенностей;
	
	ИспользоватьХарактеристики           = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьСерииНоменклатуры        = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	ИспользоватьСерииНоменклатурыОстатки = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	ОбновитьРеквизитыВидимостиФормы();
	
	НоменклатураВДокументахСервер.ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристик(ЭтотОбъект);
	
	УстановитьВидимостьИДоступность(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СкладБыл = Объект.СтруктурнаяЕдиница;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр)
		// Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор Тогда
		
		ИзменилосьКоличество = ПолучитьСерииНоменклатурыИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Если ИзменилосьКоличество Тогда
			РассчитатьСуммуВСтрокеТабличнойЧасти();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СкладБыл) И СкладБыл <> Объект.СтруктурнаяЕдиница Тогда
		ОчиститьТаблицыНаСервере();
	КонецЕсли;
	
	СтруктурнаяЕдиницаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	Модифицированность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриАктивизацииСтроки(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	ТаблицаДанных.Очистить();
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеРасчетаПоСтрокеНаСервере(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	// Серии номенклатуры
	Для Каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		
		СерииНоменклатурыУНФКлиентСервер.УдалитьСерииНоменклатурыПоКлючуСвязи(
			Объект.СерииНоменклатуры,
			ТекущиеДанныеСтроки,
			ИспользоватьСерииНоменклатурыОстатки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
	
	Если НоваяСтрока И Копирование Тогда
		СтрокаТабличнойЧасти.КлючСвязи = 0;
		СтрокаТабличнойЧасти.СерииНоменклатуры = "";
		СтрокаТабличнойЧасти.ИдентификаторСтроки = "";
		СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, Элемент.ТекущиеДанные);
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент = Элементы.ЗапасыСерииНоменклатуры Тогда
		ОткрытьПодборСерииНоменклатуры();
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		СтрокаТабличнойЧасти.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("ЗапасыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		
		ПодборНоменклатурыИзСписка = ВыбранноеЗначение.Свойство("Ячейка");
		
		Если НЕ ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтруктураВыбораНоменклатуры = Новый Структура("Характеристика");
		КонецЕсли;
		
		СтруктураВыбораНоменклатуры.Характеристика = ВыбранноеЗначение.Характеристика;
		
		Если ВыбранноеЗначение.Свойство("СтруктураНастроек") Тогда
			НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(
				ЭтотОбъект,
				"СписаниеЗапасов",
				НастройкиФормыВыбораНоменклатуры,
				Истина,
				"Запасы",
				ВыбранноеЗначение.СтруктураНастроек);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
		НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(ЭтотОбъект, "Запасы");
		
		ВыбранноеЗначение = ВыбранноеЗначение.Номенклатура;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерииНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерииНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Серии номенклатуры
	Если ИспользоватьСерииНоменклатурыОстатки <> Неопределено Тогда
		СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СерииНоменклатурыУНФКлиентСервер.ОбновитьСтатусСерииВСтроке(Объект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	РассчитатьСуммуВСтрокеТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	РассчитатьЦенуВСтрокеТабличнойЧасти();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроизвестиРасчет(Команда)
	
	Если Не ПроверитьКорректность() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Запасы.Количество() > 0 Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПроизвестиРасчетВопросОчисткиЗавешение", ЭтотОбъект),
			НСтр("ru = 'Таблица товаров не пустая и при перерасчете будет перезаполнена. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет,,,
			НСтр("ru = 'Продолжить расчет?'"));
		Возврат;
	КонецЕсли;
	
	ПроизвестиРасчетВопросОчисткиЗавешение(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокумент(Команда)
	
	Если Не ПроверитьКорректность(Истина) Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.Ссылка = СформироватьДокументСписанияНаСервере();
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДатаДокументаСписания = ПолучитьДатуДокументаСписания(Объект.Ссылка);
		Элементы.ЖурналСписаний.Обновить();
	Иначе
		ДатаДокументаСписания = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоРозничнымЦенам(Команда)
	
	ЕстьОшибки = Ложь;
	Если Объект.Запасы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не заполнена таблица Запасы. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не указан Склад. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ЦеныРассчитаны = ЗаполнитьЦеныПоРозничнымЦенамСервер();
	ОповеститьОбОкончанииЗаполненияЦенПоРозничнымЦенам(ЦеныРассчитаны);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоВидуЦен(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не заполнена таблица Запасы. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВидыЦен.Форма.ФормаВыбора", , , , , ,
		Новый ОписаниеОповещения("ЗаполнитьПоВидуЦенЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВыделенныхСтрокПоРозничнымЦенам(Команда)
	
	ЕстьОшибки = Ложь;
	Если Объект.Запасы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не заполнена таблица Запасы. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		ЕстьОшибки = Истина;
	ИначеЕсли Элементы.Запасы.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Нет выделенных строк товаров. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не указан Склад. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ЦеныРассчитаны = ЗаполнитьЦеныПоРозничнымЦенамСервер(Истина);
	ОповеститьОбОкончанииЗаполненияЦенПоРозничнымЦенам(ЦеныРассчитаны);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не заполнена таблица Запасы. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		Возврат;
	ИначеЕсли Элементы.Запасы.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Нет выделенных строк товаров. Цены не могут быть заполнены'"),,
			НСтр("ru='Ошибка заполнения'"));
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПоВыделеннымСтрокам", Истина);
	
	ОткрытьФорму("Справочник.ВидыЦен.Форма.ФормаВыбора", , , , , ,
		Новый ОписаниеОповещения("ЗаполнитьПоВидуЦенЗавершение", ЭтотОбъект, ДопПараметры));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьТаблицыНаСервере()
	
	Объект.Запасы.Очистить();
	Объект.СерииНоменклатуры.Очистить();
	ТаблицаДанных.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СтруктурнаяЕдиницаПриИзмененииНаСервере()
	
	ОбновитьРеквизитыВидимостиФормы();
	
	ОбновитьНастройкиФормыВыбораНоменклатурыПриИзмененииРеквизита();
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбновитьНастройкиФормыВыбораНоменклатурыПриИзмененииРеквизита();
	ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	
	СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Объект, СтруктураДанные);
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	
	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		Если ПодборНоменклатурыИзСписка И ТипЗнч(СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
			СтрокаТабличнойЧасти.Характеристика = СтруктураВыбораНоменклатуры.Характеристика;
			СтруктураВыбораНоменклатуры.Характеристика = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
	КонецЕсли;
	
	// Серии номенклатуры
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		СерииНоменклатурыУНФКлиентСервер.УдалитьСерииНоменклатурыПоКлючуСвязи(
			Объект.СерииНоменклатуры,
			ТекущиеДанныеСтроки,
			ИспользоватьСерииНоменклатурыОстатки);
	КонецЦикла;
	
	СтрокаТабличнойЧасти.СтатусыСерийНоменклатуры = СтруктураДанные.СтатусыСерийНоменклатуры;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	Если НЕ СтруктураДанные.Свойство("ЕдиницаИзмерения") Тогда
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	КонецЕсли;
	Если НЕ СтруктураДанные.Свойство("Коэффициент") Тогда
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			СтруктураДанные.Вставить("Коэффициент", СтруктураДанные.ЕдиницаИзмерения.Коэффициент);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли;
	КонецЕсли;
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура)
		И СтруктураДанные.Номенклатура.ИспользоватьХарактеристики Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика", ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика), СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики", Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", СтруктураДанные.Номенклатура.ПроверятьЗаполнениеХарактеристики);
	КонецЕсли; 
	// Конец Характеристики
	
	Если СтруктураДанные.Свойство("Цена") И ЗначениеЗаполнено(СтруктураДанные.Цена) Тогда
		// При подборе наборов расчет цены не требуется - используется цена, указанная в подборе
	ИначеЕсли СтруктураДанные.Свойство("ВидЦенКонтрагента") Тогда
		
		Если СтруктураДанные.Свойство("Характеристика") И СтруктураДанные.Характеристика = Неопределено Тогда
			СтруктураДанные.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
		ИначеЕсли НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		КонецЕсли;
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦенКонтрагента(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	ИначеЕсли СтруктураДанные.Свойство("ВидЦен") Тогда
		
		Если СтруктураДанные.Свойство("Характеристика") И СтруктураДанные.Характеристика = Неопределено Тогда
			СтруктураДанные.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
		ИначеЕсли НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		КонецЕсли;
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	СтруктураДанные.Вставить("ЭтоНабор", СтруктураДанные.Номенклатура.ЭтоНабор);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) И СтруктураДанные.Номенклатура.ИспользоватьСерииНоменклатуры Тогда
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные));
	Иначе
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", 0);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ТипНоменклатуры", СтруктураДанные.Номенклатура.ТипНоменклатуры);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКорректность(ПроверятьТЧ = Ложь)
	
	ЕстьОшибки = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнена дата расчета.'"), , "Объект.Дата");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнена организация.'"), , "Объект.Организация");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ОтображатьСчетаУчета") И НЕ ЗначениеЗаполнено(Объект.Корреспонденция) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен счет учета корреспонденции.'"), , "Объект.Корреспонденция");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен склад.'"), , "Объект.СтруктурнаяЕдиница");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ПроверятьТЧ Тогда
		
		Если Объект.Запасы.Количество() = 0 Тогда 
			ТекстСообщения = НСтр("ru='Нет данных для создания документа списания.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				ТекстСообщения = НСтр("ru='Строка № %1: Не заполнена номенклатура.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТЧ.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Запасы["+Строка(СтрокаТЧ.НомерСтроки-1)+"].Номенклатура");
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
				ТекстСообщения = НСтр("ru='Строка № %1: Не заполнено количество.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТЧ.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Запасы["+Строка(СтрокаТЧ.НомерСтроки-1)+"].Количество");
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
				ТекстСообщения = НСтр("ru='Строка № %1: Не заполнена цена.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТЧ.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Запасы["+Строка(СтрокаТЧ.НомерСтроки-1)+"].Цена");
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Сумма) Тогда
				ТекстСообщения = НСтр("ru='Строка № %1: Не заполнена сумма.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТЧ.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Запасы["+Строка(СтрокаТЧ.НомерСтроки-1)+"].Сумма");
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		НоменклатураВДокументахСервер.ПроверитьЗаполнениеХарактеристик(ОбработкаОбъект, ЕстьОшибки);
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтруктурнаяЕдиница, "ОрдерныйСклад") = Истина Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Объект", ОбработкаОбъект);
			ДополнительныеПараметры.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
			СерииНоменклатурыУНФ.ПроверитьЗаполнениеСерийНоменклатуры(
				ЕстьОшибки,
				ОбработкаОбъект.Запасы,
				ОбработкаОбъект.СерииНоменклатуры,
				ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция НайтиДокументСписания()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	СписаниеЗапасов.Дата КАК Дата,
	|	СписаниеЗапасов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеЗапасов КАК СписаниеЗапасов
	|ГДЕ
	|	СписаниеЗапасов.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И СписаниеЗапасов.Проведен
	|	И НЕ СписаниеЗапасов.ПометкаУдаления
	|	И СписаниеЗапасов.Дата >= &ДатаРасчета
	|	И СписаниеЗапасов.СтруктурнаяЕдиница = &Склад
	|	И СписаниеЗапасов.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеЗапасов.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ДатаРасчета", Объект.Дата);
	Запрос.УстановитьПараметр("Склад", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Справочники.ХозяйственныеОперации.ор_СписаниеПоНормамЕстественнойУбыли);
	Результат = Запрос.Выполнить();
	
	Объект.Ссылка         = Неопределено;
	ДатаДокументаСписания = Неопределено;
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Объект.Ссылка         = Выборка.Ссылка;
		ДатаДокументаСписания = Выборка.Дата;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПроизвестиРасчетВопросОчисткиЗавешение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если НайтиДокументСписания() Тогда
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По данному складу уже проводилось списание на %1
			|Перезаполнить существующий документ списания?'"),
			ДатаДокументаСписания);
			
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПроизвестиРасчетЗавешение", ЭтотОбъект),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,,,
			НСтр("ru = 'Перезаполнить списание?'"));
		Возврат;
	КонецЕсли;
	
	ПроизвестиРасчетЗавешение(КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиРасчетЗавешение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Ссылка         = Неопределено;
		ДатаДокументаСписания = Неопределено;
	ИначеЕсли Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПроизвестиРасчетНаСервере();
	ЗапасыПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПроизвестиРасчетНаСервере()
	
	ОчиститьТаблицыНаСервере();
	
	Если ЗначениеЗаполнено(ДатаДокументаСписания) Тогда
		Объект.Дата = ДатаДокументаСписания;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРасчета", Объект.Дата);
	Запрос.УстановитьПараметр("Склад", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Аналитика", Справочники.ХозяйственныеОперации.ор_СписаниеПоНормамЕстественнойУбыли);
	
	// Сохраним дату расчета чтобы создать документ инвентаризации именно на рассчитанную дату.
	ДатаПоКоторойСделанРасчет = Объект.Дата;
	
	// Определим дату предыдущего расчета списания по нормам ЕУ.
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СписаниеЗапасов.Дата КАК Дата,
	|	СписаниеЗапасов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеЗапасов КАК СписаниеЗапасов
	|ГДЕ
	|	СписаниеЗапасов.ХозяйственнаяОперация = &Аналитика
	|	И СписаниеЗапасов.Проведен
	|	И НЕ СписаниеЗапасов.ПометкаУдаления
	|	И СписаниеЗапасов.Дата < &ДатаРасчета
	|	И СписаниеЗапасов.СтруктурнаяЕдиница = &Склад
	|	И СписаниеЗапасов.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеЗапасов.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаПредыдущегоРасчета = Выборка.Дата;
	Иначе
		ДатаПредыдущегоРасчета = '00010101';
	КонецЕсли;
	
	// Сформируем таблицу расчетных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НормыЕстественнойУбылиСрезПоследних.ВидНормыЕУ КАК ВидНормы,
	|	НормыЕстественнойУбылиСрезПоследних.Номенклатура КАК Номенклатура,
	|	СРЕДНЕЕ(НормыЕстественнойУбылиСрезПоследних.ЗначениеНормы) КАК ЗначениеНормы
	|ПОМЕСТИТЬ НормыЕУ
	|ИЗ
	|	РегистрСведений.ор_НормыЕстественнойУбыли.СрезПоследних(, ) КАК НормыЕстественнойУбылиСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	НормыЕстественнойУбылиСрезПоследних.ВидНормыЕУ,
	|	НормыЕстественнойУбылиСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗапасыНаСкладахОбороты.Регистратор.Дата, ДЕНЬ) КАК Дата,
	|	ЗапасыНаСкладахОбороты.Регистратор.ВидНормыЕУ КАК ВидНормы,
	|	ЗапасыНаСкладахОбороты.Регистратор КАК Регистратор,
	|	ЗапасыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОбороты.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЗапасыНаСкладахОбороты.КоличествоРасход) КАК Количество
	|ПОМЕСТИТЬ ЗапасыНаСкладах
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаКонца,
	|			Регистратор,
	|			Организация = &Организация
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						НормыЕУ.Номенклатура
	|					ИЗ
	|						НормыЕУ КАК НормыЕУ)
	|				И СтруктурнаяЕдиница = &Склад) КАК ЗапасыНаСкладахОбороты
	|ГДЕ
	|	ЗапасыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ор_ИзготовлениеЛекарственныхФорм
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладахОбороты.Номенклатура,
	|	ЗапасыНаСкладахОбороты.Номенклатура.ЕдиницаИзмерения,
	|	НАЧАЛОПЕРИОДА(ЗапасыНаСкладахОбороты.Регистратор.Дата, ДЕНЬ),
	|	ЗапасыНаСкладахОбороты.Регистратор.ВидНормыЕУ,
	|	ЗапасыНаСкладахОбороты.Регистратор,
	|	ЗапасыНаСкладахОбороты.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.Дата КАК ДатаРасхода,
	|	Движения.Номенклатура КАК Номенклатура,
	|	Движения.Характеристика КАК Характеристика,
	|	Движения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормыЕУ.ВидНормы КАК НормаЕстественнойУбыли,
	|	НормыЕУ.ЗначениеНормы КАК ПроцентНормы,
	|	СУММА(Движения.Количество) КАК КоличествоРасход,
	|	СУММА(Движения.Количество * (НормыЕУ.ЗначениеНормы / 100)) КАК РассчитаноПоНормеЕУ
	|ИЗ
	|	НормыЕУ КАК НормыЕУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыНаСкладах КАК Движения
	|		ПО НормыЕУ.Номенклатура = Движения.Номенклатура
	|			И НормыЕУ.ВидНормы = Движения.ВидНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Дата,
	|	Движения.ЕдиницаИзмерения,
	|	НормыЕУ.ВидНормы,
	|	Движения.Номенклатура,
	|	НормыЕУ.ЗначениеНормы,
	|	Движения.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРасхода,
	|	НормаЕстественнойУбыли";
	
	Запрос.УстановитьПараметр("ДатаНачала" , ДатаПредыдущегоРасчета + 1);
	Запрос.УстановитьПараметр("ДатаКонца"  , Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад"      , Объект.СтруктурнаяЕдиница);
	ИсходнаяТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаРасчета.Загрузить(ИсходнаяТаблицаДанных);
	
	ИсходнаяТаблицаДанных.Колонки.Удалить("НормаЕстественнойУбыли");
	ИсходнаяТаблицаДанных.Колонки.Удалить("ПроцентНормы");
	ИсходнаяТаблицаДанных.Колонки.Удалить("ДатаРасхода");
	ИсходнаяТаблицаДанных.Колонки.Удалить("КоличествоРасход");
	
	ИсходнаяТаблицаДанных.Свернуть("Номенклатура, Характеристика, ЕдиницаИзмерения", "РассчитаноПоНормеЕУ");
	Для Каждого СтрокаТоваров Из ИсходнаяТаблицаДанных Цикл
		Если СтрокаТоваров.РассчитаноПоНормеЕУ = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура     = СтрокаТоваров.Номенклатура;
		НоваяСтрока.Характеристика   = СтрокаТоваров.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаТоваров.ЕдиницаИзмерения;
		НоваяСтрока.Количество       = СтрокаТоваров.РассчитаноПоНормеЕУ;
		
		СтруктураДанныеНоменклатуры = Новый Структура();
		СтруктураДанныеНоменклатуры.Вставить("Номенклатура", СтрокаТоваров.Номенклатура);
		СтруктураДанныеНоменклатуры.Вставить("Характеристика", СтрокаТоваров.Характеристика);
		
		СерииНоменклатурыУНФКлиентСервер.ДополнитьСтруктуруДаннымиДляПолученияСерийНоменклатуры(Объект, СтруктураДанныеНоменклатуры);
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
		
		НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
		НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
		НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
		
		Если СтруктураДанные.ИспользоватьХарактеристики Тогда
			НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
		// Конец Характеристики
		
		НоваяСтрока.СтатусыСерийНоменклатуры = СтруктураДанные.СтатусыСерийНоменклатуры;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "КлючСвязи") Тогда
			НоваяСтрока.КлючСвязи = ТабличныеЧастиУНФКлиентСервер.СоздатьНовыйКлючСвязи(ЭтотОбъект);
		КонецЕсли;
		
		// Серии номенклатуры
		Если ИспользоватьСерииНоменклатурыОстатки <> Неопределено Тогда
			СерииНоменклатурыУНФКлиентСервер.ОбновитьСерииНоменклатурыКоличество(Объект, НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРасчетаПоСтрокеНаСервере(Номенклатура, Характеристика)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Номенклатура);
	ПараметрыОтбора.Вставить("Характеристика", Характеристика);
	МассивНайденныхСтрок = ТаблицаРасчета.НайтиСтроки(ПараметрыОтбора);
	Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьДокументСписанияНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.СписаниеЗапасов.СоздатьДокумент();
	КонецЕсли;
	
	ДокументОбъект.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ор_СписаниеПоНормамЕстественнойУбыли;
	ДокументОбъект.Дата = Объект.Дата;
	ДокументОбъект.Автор = Пользователи.ТекущийПользователь();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Объект);
	
	// Не используем МДЛП в списании по нормам ЕУ.
	ДокументОбъект.ор_НеИспользоватьМаркировкуЛС = Истина;
	
	ДокументОбъект.Запасы.Загрузить(Объект.Запасы.Выгрузить());
	ДокументОбъект.СерииНоменклатуры.Загрузить(Объект.СерииНоменклатуры.Выгрузить());
	ДокументОбъект.Комментарий = Объект.Комментарий;
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Объект.Запасы.Очистить();
		Объект.СерииНоменклатуры.Очистить();
		ТаблицаДанных.Очистить();
		ТаблицаРасчета.Очистить();
		
		Объект.Комментарий = "";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ списания успешно создан'"));
		Возврат ДокументОбъект.Ссылка;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось создать документ списания'"));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуДокументаСписания(ДокументСписания)
	Возврат ДокументСписания.Дата;
КонецФункции

&НаСервере
Процедура ОбновитьРеквизитыВидимостиФормы()
	
	СтрокаРеквизитов = "ТипСтруктурнойЕдиницы, ОрдерныйСклад";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтруктурнаяЕдиница, СтрокаРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов, СтрокаРеквизитов);
	
	УчетПоЯчейкам = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИДоступность(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика", "Видимость", Форма.ИспользоватьХарактеристики);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыГруппаСерииНоменклатуры", "Видимость", Форма.ИспользоватьСерииНоменклатуры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Ячейка",
		"Доступность",
		ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница)
			И НЕ Форма.ОрдерныйСклад
			И НЕ Форма.ТипСтруктурнойЕдиницы = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Розница")
			И Форма.УчетПоЯчейкам
	);
	
	НоменклатураВДокументахКлиентСервер.ЗаполнитьТаблицуНастроекФормыВыбораНоменклатуры(
		Форма,
		"СписаниеЗапасов",
		Форма.НастройкиФормыВыбораНоменклатуры,
		Истина);
	НоменклатураВДокументахКлиентСервер.ОбновитьПараметрыОткрытияФормыВыбора(Форма, "Запасы");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиФормыВыбораНоменклатурыПриИзмененииРеквизита()
	
	НоменклатураВДокументахСервер.ОбновитьНастройкиФормыВыбораНоменклатурыПриИзмененииРеквизита(
		ЭтотОбъект,
		"СписаниеЗапасов",
		"Запасы",
		НастройкиФормыВыбораНоменклатуры);
	
КонецПроцедуры

#Область ЗаполнениеЦен

&НаКлиенте
Процедура ЗаполнитьПоВидуЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(
		Результат,
		ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("ПоВыделеннымСтрокам"));
	ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, Результат);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЦеныПоРозничнымЦенамСервер(ПоВыделеннымСтрокам = Ложь)
	
	ВидЦены = Объект.СтруктурнаяЕдиница.РозничныйВидЦен;
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		ВидЦены = Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();
	КонецЕсли;
	
	ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(
		ВидЦены,
		ПоВыделеннымСтрокам);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаСервере
Функция ЗаполнитьЦеныПоВидуЦенСервер(ВидЦены, ПоВыделеннымСтрокам = Ложь)
	
	ЦеныРассчитаны = Ложь;
	
	Если ПоВыделеннымСтрокам Тогда
		ТабличнаяЧасть = Новый Массив;
		Для Каждого ТекущийИдентификатор Из Элементы.Запасы.ВыделенныеСтроки Цикл
			НайденнаяСтрока = Объект.Запасы.НайтиПоИдентификатору(ТекущийИдентификатор);
			Если НайденнаяСтрока <> Неопределено Тогда
				ТабличнаяЧасть.Добавить(НайденнаяСтрока);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТабличнаяЧасть = Объект.Запасы;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Новый Структура();
		СтрокаТабличнойЧасти.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
		СтрокаТабличнойЧасти.Вставить("Характеристика", СтрокаТЧ.Характеристика);
		СтрокаТабличнойЧасти.Вставить("ЕдиницаИзмерения", СтрокаТЧ.ЕдиницаИзмерения);
		СтрокаТабличнойЧасти.Вставить("Цена", 0);
		
		МассивСтрок.Добавить(СтрокаТабличнойЧасти);
		
	КонецЦикла;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат ЦеныРассчитаны;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Дата", Объект.Дата);
	СтруктураДанных.Вставить("Организация", Константы.УчетПоКомпании.Компания(Объект.Организация));
	СтруктураДанных.Вставить("ВидЦен", ВидЦены);
	СтруктураДанных.Вставить("ВалютаДокумента", Константы.НациональнаяВалюта.Получить());
	ЦенообразованиеСервер.ПолучитьЦеныТабличнойЧастиПоВидуЦен(СтруктураДанных, МассивСтрок);
	
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", СтрокаТЧ.Характеристика);
		СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтрокаТЧ.ЕдиницаИзмерения);
		
		РезультатПоиска = Объект.Запасы.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаРезультат Из РезультатПоиска Цикл
			
			СтрокаРезультат.Цена  = СтрокаТЧ.Цена;
			СтрокаРезультат.Сумма = СтрокаРезультат.Количество * СтрокаРезультат.Цена;
			
			ЦеныРассчитаны = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен)
	
	ТекстРезультата = ?(
		ЦеныРассчитаны,
		НСтр("ru='заполнены'"),
		НСтр("ru='не заполнены'"));
		
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Цены по виду цен ""%1"" в таблице товаров %2'"),
		ВидЦен,
		ТекстРезультата
	);
	ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цены %1'"), ТекстРезультата),,
		ТекстСообщения,
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОкончанииЗаполненияЦенПоРозничнымЦенам(ЦеныРассчитаны)
	
	ТекстРезультата = ?(
		ЦеныРассчитаны,
		НСтр("ru='заполнены'"),
		НСтр("ru='не заполнены'"));
		
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Розничные цены по складу ""%1"" в таблице товаров %2'"),
		Объект.СтруктурнаяЕдиница,
		ТекстРезультата
	);
	ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Цены %1'"), ТекстРезультата),,
		ТекстСообщения,
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры 

#КонецОбласти

#Область РаботаССериямиНоменклатуры

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияСерийПриИзмененииКлючевыхРеквизитов()
	ДополнительныеСвойства = Новый Структура("ИзменениеКлючевыхРеквизитов", Истина);
	СерииНоменклатурыУНФ.ЗаполнитьПризнакиИспользованияСерий(Объект, ДополнительныеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерииНоменклатуры()
	
	ТекущиеДанныеИдентификатор = Элементы.Запасы.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийНоменклатуры = ПараметрыПодбораСерийНоменклатуры(ТекущиеДанныеИдентификатор);
	
	ОткрытьФорму("Обработка.ПодборСерийНоменклатуры.Форма", ПараметрыСерийНоменклатуры, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСерииНоменклатурыИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	Модифицированность = Истина;
	Возврат СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки);
	
КонецФункции

&НаСервере
Функция ПараметрыПодбораСерийНоменклатуры(ТекущиеДанныеИдентификатор)
	
	Возврат СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатуры(Объект, ЭтотОбъект.УникальныйИдентификатор,
		ТекущиеДанныеИдентификатор);
	
КонецФункции

#КонецОбласти

#КонецОбласти
